УправлениеПаркомАттракционов/src/DataProcessors/ВыгрузкаНаСайт/ВыгрузкаНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаНаСайт</name>
</mdclass:DataProcessor>

УправлениеПаркомАттракционов/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеПаркомАттракционов/src/Catalogs/Аттракционы/Аттракционы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аттракционы</name>
  <attributes>
    <name>ВидАттракциона</name>
    <type>
      <types>CatalogRef.ВидыАттракционов</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширениеФайлаФото</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеПаркомАттракционов/src/DataProcessors/ВыгрузкаНаСайт/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подготовить архив.
// 
// Возвращаемое значение:
//  Строка - Подготовить архив
Функция ПодготовитьАрхив() Экспорт
	
	ИмяКаталога = ПолучитьИмяВременногоФайла("");
	СоздатьКаталог(ИмяКаталога);
	Шаблон = "%1%2img%2%3%4";
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Аттракционы.Ссылка)) КАК ИД,
	|	Аттракционы.Представление КАК Аттракцион,
	|	Аттракционы.ВидАттракциона.Представление КАК ВидАттракциона,
	|	Аттракционы.Фото,
	|	ЕСТЬNULL(ЦеныНоменклатурыСрезПервых.Цена, 0) КАК Цена,
	|	Аттракционы.РасширениеФайлаФото
	|ИЗ
	|	Справочник.Аттракционы КАК Аттракционы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПервых КАК ЦеныНоменклатурыСрезПервых
	|		ПО Аттракционы.ВидАттракциона = ЦеныНоменклатурыСрезПервых.Номенклатура.ВидАттракциона
	|ГДЕ
	|	Аттракционы.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Аттракцион";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОписаниеАттракционов = Новый Массив();

	Пока Выборка.Следующий() Цикл
		
		ОписаниеАттракциона = Новый Структура("ИД, Аттракцион, ВидАттракциона, Цена");
		ЗаполнитьЗначенияСвойств(ОписаниеАттракциона, Выборка);

		ДанныеФото = Выборка.Фото.Получить();
		
		Если ДанныеФото = Неопределено Тогда
			ОписаниеАттракциона.Вставить("Фото", Неопределено);
		Иначе
			ИмяФайла = СтрШаблон(Шаблон, ИмяКаталога, ПолучитьРазделительПути(), Выборка.ИД, Выборка.РасширениеФайлаФото);
			ДанныеФото.Записать(ИмяФайла);
			ИмяФайла = СтрШаблон(Шаблон, "", ПолучитьРазделительПути(), Выборка.ИД, Выборка.РасширениеФайлаФото);
			ОписаниеАттракциона.Вставить("Фото", ИмяФайла);			
			
		КонецЕсли;	
		
		ОписаниеАттракционов.Добавить(ОписаниеАттракциона);
		
	КонецЦикла;
	
	ИмяФайлаВыгрузки = СтрШаблон("%1%2export.json", ИмяКаталога, ПолучитьРазделительПути());
	Запись = Новый ЗаписьJSON();
	Запись.ОткрытьФайл(ИмяФайлаВыгрузки);
	ЗаписатьJSON(Запись, ОписаниеАттракционов);
	Запись.Закрыть();
	
	ИмяФайлаАрхива = СтрШаблон("%1%2*.*", ИмяКаталога, ПолучитьРазделительПути());
	Архиватор = Новый ЗаписьZipФайла();
	Архиватор.Добавить(ИмяФайлаАрхива, , РежимОбработкиПодкаталоговZIP.ОбрабатыватьРекурсивно);
	ДанныеАрхива = Архиватор.ПолучитьДвоичныеДанные();

	Адрес = ПоместитьВоВременноеХранилище(ДанныеАрхива, Новый УникальныйИдентификатор());
	УдалитьФайлы(ИмяКаталога);
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти

#КонецЕсли
